package com.ua.RD.lesson15;

public interface Figure {
    //інтрефейс - це абстрактний клас
    //
    //всі методи паблік за замовчуавнням, приватні не мают реалізації
    //змінні в інтерфейсах - паблік статік файнал(константа)
    // якщо інтерфейс єкстендиться - то і в усіх імплементних методах потрібно викликати
    // методи батьківського для інтерфейсу
    // в інтерфейси не потрібно виносити усі методи, краще 5 інтерфейсів по 1 методу
    //інтерфейс може єкстендитись від кількох інших інтерфейсів
    //реалізація методів через дефолтний метод
    //крім дефолтних методів можеть бути статичні методи
    //через клас, який інплементує, також викликається такий метод
    //при виклику методу викликається конструктор
    //контрл+лкм - список інтерфейсів
    default void sayName() {

    }


    double getArea();
}
