package com.ua.RD.lesson10.part3;

public class Main {
    public static void main(String[] args) {

        Child child = new Child();
        System.out.println(child);

//        Car c1 = new Car(100);
//        Car c2 = new Car(200);
//
//        System.out.println(Car.type);
//        Car.ride();
//        String type = Car.type;
//        Car.type = "qqqqqq";
//        System.out.println(type);
//        System.out.println(Car.type);

        //не створюємо змінну для отримання доступу до type,
        //викликання методу без створення його об'єкту
        //статік одразу потрапляє до пам'яті і викликається звідти, створюється "автоматично"
        //не має сенсу створювати поле у класі, якщо через статік він буде однаковий для всіх класів
        //статика використовується коли ми створюємо один об'єкт класу
        //статика використовується коли ми створюємо "Ютильні класи"
        //в статичних методах не можна працювати зі звичайними даними
        //статік можна перевантажувати, переопреділяти неможливо
        //тілько у СінглТонах, щоб контролювати наявність тілько одного об'єкта
        //статік використовується для констант


        //        System.out.println(c1);
        //        System.out.println(c2);


    }


}
